#+startup: indent show2levels
#+title:
#+author masayuki

*** [[https://www.python.jp/train/type_and_func/modules.html][モジュールとimport: ゼロからのPython入門講座 - python.jp]]
- あらかじめ用意された関数の集りをモジュールと言う。
- 機能ごとに分類されている
  - math モジュールは，数学関連の機能

- モジュールの利用: import
  #+begin_src python :session *python* :result output
import math
math.sin(3.14)
  #+end_src

  #+RESULTS:
  : 0.0015926529164868282

*** [[https://atmarkit.itmedia.co.jp/ait/articles/1907/26/news020.html][［Python入門］クラスの基礎知識：Python入門（1/2 ページ） - ＠IT]]

#+begin_src python :session *python* :result output
type('a')
#+end_src

#+RESULTS:
: <class 'str'>

#+begin_src python :session *python* :result output
from math import sqrt

class Point:
    def __init__(self, x=0.0, y=0.0):
        self.x = x
        self.y = y
    def difference(self, point=None):
        if not point:
            point = Point()
        return sqrt((self.x - point.x) **2
                    + (self.y - point.y)**2)
    
#+end_src

#+RESULTS:
#+begin_src python :session *python* :result output
p1 = Point(10.0,10.0)
p1.difference()

#+end_src

#+RESULTS:
: 14.142135623730951

#+begin_src python :session *python* :result output
Point

#+end_src

#+RESULTS:
: <class '__main__.Point'>

#+begin_src python :session *python* :result output

#+end_src



* python 関数 IT
[[https://atmarkit.itmedia.co.jp/ait/articles/1905/17/news020.html][［Python入門］関数の基本：Python入門（1/2 ページ） - ＠IT]]

#+begin_src python :session *python* :result output
def fact(n):
    if n==1:
       return 1
    else:
       return n*fact(n-1)

fact(100)
#+end_src

#+RESULTS:
: 93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000
